
# State **`s3://infrahouse-github-state/github.state`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       2 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                             |
|:--------:|:----------------------------------------------------------------------|
|    🟢     | `module.repos["infrahouse-website-infra"].github_repository.repo`     |
|    🟢     | `module.repos["infrahouse-website-infra"].github_team_repository.dev` |
|    🟢     | `github_organization_settings.infrahouse:`                            |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/d56a4545-cf36-49c6-9e18-4a3d6b3b486e/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team.dev: Refreshing state... [id=7332815]
github_team_members.dev: Refreshing state... [id=7332815]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]
github_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos["infrahouse-website-infra"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "InfraHouse Infrastructure"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "infrahouse-website-infra"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # module.repos["infrahouse-website-infra"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "infrahouse-website-infra"
      + team_id    = "7332815"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: github_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:990466748045:secret:_github_control__PYPI_API_TOKEN-dhII9P|AWSCURRENT]%0Agithub_actions_secret.pypi_api_token["infrahouse-toolkit"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.repos["infrahouse-website-infra"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "InfraHouse Infrastructure"%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_issues                  = true%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "infrahouse-website-infra"%0A      + node_id                     = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + visibility                  = "public"%0A%0A      + security_and_analysis {%0A          + advanced_security {%0A              + status = (known after apply)%0A            }%0A%0A          + secret_scanning {%0A              + status = (known after apply)%0A            }%0A%0A          + secret_scanning_push_protection {%0A              + status = (known after apply)%0A            }%0A        }%0A    }%0A%0A  # module.repos["infrahouse-website-infra"].github_team_repository.dev will be created%0A  + resource "github_team_repository" "dev" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "push"%0A      + repository = "infrahouse-website-infra"%0A      + team_id    = "7332815"%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLXN0YXRlL2dpdGh1Yi5zdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJzdGRvdXQiOiAiW2NvbW1hbmRdL2hvbWUvcnVubmVyL3dvcmsvX3RlbXAvZDU2YTQ1NDUtY2YzNi00OWM2LTllMTgtNGEzZDZiM2I0ODZlL3RlcnJhZm9ybS1iaW4gcGxhbiAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX3RlYW1fbWVtYmVycy5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjk5MDQ2Njc0ODA0NTpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi1kaElJOVBdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS10b29sa2l0XVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLnJlcG9zW1wiY29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmNvb2tpZWN1dHRlci1naXRodWItY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkaW5nLi4uXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UHxBV1NDVVJSRU5UXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnB5cGlfYXBpX3Rva2VuW1wiaW5mcmFob3VzZS10b29sa2l0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6UFlQSV9BUElfVE9LRU5dXHUwMDFiWzBtXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgXHUwMDFiWzMybStcdTAwMWJbMG0gY3JlYXRlXG5cdTAwMWJbMG1cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG9cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXHUwMDFiWzBtXHUwMDFiWzBtXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19hdXRvX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfbWVyZ2VfY29tbWl0XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfcmViYXNlX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfc3F1YXNoX21lcmdlXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYXJjaGl2ZWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlZmF1bHRfYnJhbmNoXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWRlbGV0ZV9icmFuY2hfb25fbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICA9IGZhbHNlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZXNjcmlwdGlvblx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgPSBcIkluZnJhSG91c2UgSW5mcmFzdHJ1Y3R1cmVcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZXRhZ1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZnVsbF9uYW1lXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZ2l0X2Nsb25lX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaGFzX2lzc3Vlc1x1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHRtbF91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHR0cF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgID0gXCJQUl9USVRMRVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1tZXJnZV9jb21taXRfdGl0bGVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSBcIk1FUkdFX01FU1NBR0VcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbmFtZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtbm9kZV9pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcHJpdmF0ZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb19pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlXHUwMDFiWzBtXHUwMDFiWzBtID0gXCJDT01NSVRfTUVTU0FHRVNcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZVx1MDAxYlswbVx1MDAxYlswbSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3NoX2Nsb25lX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3ZuX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdmlzaWJpbGl0eVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIlxuXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWN1cml0eV9hbmRfYW5hbHlzaXMge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbWFkdmFuY2VkX3NlY3VyaXR5IHtcbiAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nIHtcbiAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3RhdHVzXHUwMDFiWzBtXHUwMDFiWzBtID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgfVxuXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtc2VjcmV0X3NjYW5uaW5nX3B1c2hfcHJvdGVjdGlvbiB7XG4gICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN0YXR1c1x1MDAxYlswbVx1MDAxYlswbSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgIH1cbiAgICAgICAgfVxuICAgIH1cblxuXHUwMDFiWzFtICAjIG1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldlx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcdTAwMWJbMG1cdTAwMWJbMG1cblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ldGFnXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXBlcm1pc3Npb25cdTAwMWJbMG1cdTAwMWJbMG0gPSBcInB1c2hcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcmVwb3NpdG9yeVx1MDAxYlswbVx1MDAxYlswbSA9IFwiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXRlYW1faWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgPSBcIjczMzI4MTVcIlxuICAgIH1cblxuXHUwMDFiWzBtXHUwMDFiWzFtUGxhbjpcdTAwMWJbMG0gMiB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuXG5cdTAwMWJbMG1cdTAwMWJbOTBtXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTAwMWJbMG1cblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfb3JnYW5pemF0aW9uX3NldHRpbmdzLmluZnJhaG91c2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTEyMTk4NDI2M11cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl90ZWFtLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1naXRodWJfdGVhbV9tZW1iZXJzLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXRdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldC5weXBpX2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS10b29sa2l0XVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWRpbmcuLi5cdTAwMWJbMG1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6OTkwNDY2NzQ4MDQ1OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLWRoSUk5UHxBV1NDVVJSRU5UXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbWdpdGh1Yl9hY3Rpb25zX3NlY3JldC5weXBpX2FwaV90b2tlbltcImluZnJhaG91c2UtdG9vbGtpdFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVx1MDAxYlswbSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGUlMEFcdTAwMWJbMG0lMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG9cdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXHUwMDFiWzBtXHUwMDFiWzBtJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImdpdGh1Yl9yZXBvc2l0b3J5XCIgXCJyZXBvXCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X2F1dG9fbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYWxsb3dfbWVyZ2VfY29tbWl0XHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgID0gdHJ1ZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWFsbG93X3JlYmFzZV9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1hbGxvd19zcXVhc2hfbWVyZ2VcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSB0cnVlJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtYXJjaGl2ZWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZWZhdWx0X2JyYW5jaFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZGVsZXRlX2JyYW5jaF9vbl9tZXJnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgID0gZmFsc2UlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1kZXNjcmlwdGlvblx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgPSBcIkluZnJhSG91c2UgSW5mcmFzdHJ1Y3R1cmVcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWV0YWdcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1mdWxsX25hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZ2l0X2Nsb25lX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWhhc19pc3N1ZXNcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1odG1sX3VybFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtaHR0cF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbWlkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1tZXJnZV9jb21taXRfbWVzc2FnZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgPSBcIlBSX1RJVExFXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1tZXJnZV9jb21taXRfdGl0bGVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgPSBcIk1FUkdFX01FU1NBR0VcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbW5hbWVcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1ub2RlX2lkXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtcHJpdmF0ZVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9faWRcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zcXVhc2hfbWVyZ2VfY29tbWl0X21lc3NhZ2VcdTAwMWJbMG1cdTAwMWJbMG0gPSBcIkNPTU1JVF9NRVNTQUdFU1wiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtc3F1YXNoX21lcmdlX2NvbW1pdF90aXRsZVx1MDAxYlswbVx1MDAxYlswbSAgID0gXCJDT01NSVRfT1JfUFJfVElUTEVcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXNzaF9jbG9uZV91cmxcdTAwMWJbMG1cdTAwMWJbMG0gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdm5fdXJsXHUwMDFiWzBtXHUwMDFiWzBtICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdmlzaWJpbGl0eVx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgICAgICAgICAgID0gXCJwdWJsaWNcIiUwQSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXNlY3VyaXR5X2FuZF9hbmFseXNpcyB7JTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbWFkdmFuY2VkX3NlY3VyaXR5IHslMEEgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN0YXR1c1x1MDAxYlswbVx1MDAxYlswbSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICB9JTBBJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbXNlY3JldF9zY2FubmluZyB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1zdGF0dXNcdTAwMWJbMG1cdTAwMWJbMG0gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgfSUwQSUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1zZWNyZXRfc2Nhbm5pbmdfcHVzaF9wcm90ZWN0aW9uIHslMEEgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXN0YXR1c1x1MDAxYlswbVx1MDAxYlswbSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICB9JTBBICAgICAgICB9JTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2XHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFx1MDAxYlswbVx1MDAxYlswbSUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtZXRhZ1x1MDAxYlswbVx1MDAxYlswbSAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbSBcdTAwMWJbMG1cdTAwMWJbMW1cdTAwMWJbMG1pZFx1MDAxYlswbVx1MDAxYlswbSAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXBlcm1pc3Npb25cdTAwMWJbMG1cdTAwMWJbMG0gPSBcInB1c2hcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtIFx1MDAxYlswbVx1MDAxYlsxbVx1MDAxYlswbXJlcG9zaXRvcnlcdTAwMWJbMG1cdTAwMWJbMG0gPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG0gXHUwMDFiWzBtXHUwMDFiWzFtXHUwMDFiWzBtdGVhbV9pZFx1MDAxYlswbVx1MDAxYlswbSAgICA9IFwiNzMzMjgxNVwiJTBBICAgIH0lMEElMEFcdTAwMWJbMG1cdTAwMWJbMW1QbGFuOlx1MDAxYlswbSAyIHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEFcdTAwMWJbMG1cdTAwMWJbOTBtJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUwMDFiWzBtJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDIsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>